#+TITLE: Python Packages Reference
#+STARTUP: packages
https://status.python.org/

*** coveragepy
https://github.com/nedbat/coveragepy
https://coverage.readthedocs.io/en/7.4.1/

#+begin_src bash :results output
coverage --help
#+end_src

#+RESULTS:
#+begin_example
Coverage.py, version 7.4.1 with C extension
Measure, collect, and report on code coverage in Python programs.

usage: coverage <command> [options] [args]

Commands:
    annotate    Annotate source files with execution information.
    combine     Combine a number of data files.
    debug       Display information about the internals of coverage.py
    erase       Erase previously collected coverage data.
    help        Get help on using coverage.py.
    html        Create an HTML report.
    json        Create a JSON report of coverage results.
    lcov        Create an LCOV report of coverage results.
    report      Report coverage stats on modules.
    run         Run a Python program and measure code execution.
    xml         Create an XML report of coverage results.

Use "coverage help <command>" for detailed help on any command.
Full documentation is at https://coverage.readthedocs.io/en/7.4.1
#+end_example

